function lab2()
    % Выборка
    X = [-2.79,-3.01,-4.07,-2.85,-2.43,-3.20,-3.72,-4.27,-5.48,-2.38,-4.69,-4.34,-5.08,-5.01,-4.08,-4.20,-4.74,-1.88,-3.25,-2.78,-3.56,-3.54,-3.79,-3.18,-5.08,-4.30,-2.86,-2.45,-3.08,-3.22,-2.76,-3.20,-3.33,-4.91,-4.06,-3.81,-3.96,-3.65,-3.77,-4.60,-5.21,-2.67,-1.95,-2.43,-1.73,-2.50,-3.96,-3.75,-2.70,-4.26,-3.42,-4.07,-4.74,-3.00,-4.37,-5.42,-5.00,-4.08,-2.46,-4.33,-4.08,-3.72,-4.09,-2.96,-3.71,-1.51,-3.70,-6.48,-4.26,-4.39,-3.16,-4.63,-2.66,-2.22,-4.79,-2.46,-3.69,-3.35,-2.32,-4.17,-3.85,-4.93,-2.05,-3.15,-3.49,-5.70,-2.53,-3.85,-4.32,-3.37,-3.98,-3.74,-5.28,-2.56,-3.21,-3.10,-3.78,-3.36,-3.32,-2.59,-2.45,-3.34,-3.20,-4.14,-4.00,-4.79,-4.02,-4.58,-4.45,-3.69,-4.53,-3.98,-4.51,-4.44,-3.78,-4.24,-4.00,-2.46,-2.58,-4.04];
    
    % Объем выборки
    N = length(X);
    
    % Оценка математического ожидания
    mu = mean(X)
    s_sqr = std(X, 0)^2 % Исправленная выборочная дисперсия
    
    % Функция определения доверительного интервала для мат. ожидания
    % Аргументы: 1. Выборочное среднее 2. CКО
    % 3. Объем выборки
    % 4. Уровень доверительного интервала
    % Результат: 1. Нижняя 2. Верхняя границы
    function [odown, oup] = exp_value_estimate(mu, s, n, gamma)
        q = tinv((1 + gamma) / 2, n - 1);
        odown = mu - s * q / sqrt(n);
        oup = mu + s * q / sqrt(n);
    end
    
    % Функция определения доверительного интервала для дисперсии
    % Аргументы: 1. Исправленная выборочная дисперсия. 
    % 2. Объем выборки
    % 3.Уровень дов. интервала
    % Результат: 1. Нижняя 2. Верхняя границы
    function [odown, oup] = std_sqr_estimate(s_sqr, n, gamma)
        q1 = chi2inv((1 + gamma) / 2, n-1);
        q2 = chi2inv((1 - gamma) / 2, n-1);
        tmp = (n - 1) * s_sqr;
        odown = tmp / q1;
        oup = tmp / q2;
    end

    % Уровень доверительного интервала
    gamma = 0.9;
    
    n = []; % Массив размеров выборки
    mu_n = []; % Значения cреднего в зависимости от объема выборки
    mu_down = []; % Нижняя граница дов. интервала для мат. ожидания
    mu_up = []; % Верхняя граница дов.интервала
    
    s_n = []; % Значения испр. выборочной дисперсии от объема выборки
    s_down = []; % Нижня граница дов. интервала для дисперсии
    s_up = []; % Верхняя граница
    
    % Вычисление значений для разных объемов выборки
    for i=1:N
        n(i) = i;
        mu_n(i) = mean(X(1:i));
        sigma = std(X(1:i), 0);
        s_n(i) = sigma^2;
        
        [mu_down(i), mu_up(i)] = exp_value_estimate(mu_n(i), sigma, i, gamma);
        [s_down(i), s_up(i)] = std_sqr_estimate(s_n(i), i, gamma);
    end
    
    
    % График мат. ожиданий (последняя пара - значение для всей выборки)
    figure(1)
    plot(n, mu_n, n, mu_down, n, mu_up, n, mu * ones(1, N));
    xlabel('n');
    ylabel('y');
    legend({'$y = \hat{\mu}(\overrightarrow{x}_n)$', ...
        '$y = \underline{\mu}(\overrightarrow{x}_n)$', ...
        '$y = \overline{\mu}(\overrightarrow{x}_n)$', ...
        '$y = \hat{\mu}(\overrightarrow{x}_N$)'},...
        'Location','northeast', 'Interpreter', 'latex', 'Fontsize', 14);
    
    
    % График дисперсий (последняя пара - значение для всей выборки)
    figure(2)
    plot(n, s_n, n, s_down, n, s_up, n, s_sqr * ones(1, N));
    xlabel('n');
    ylabel('z');
    legend({'$z = S^2(\overrightarrow{x}_n)$', ...
        '$z = \underline{\sigma}^2(\overrightarrow{x}_n)$',...
        '$z = \overline{\sigma}^2(\overrightarrow{x}_n)$',...
        '$z = S^2(\overrightarrow{x}_N)$'}, ...
        'Location', 'northeast', 'Interpreter', 'latex', 'Fontsize', 14);
end