function lab1( )
 % Выборка
 X=[-2.79,-3.01,-4.07,-2.85,-2.43,-3.20,-3.72,-4.27,-5.48,-2.38,-4.69,-4.34,-5.08,-5.01,-4.08,-4.20,-4.74,-1.88,-3.25,-2.78,-3.56,-3.54,-3.79,-3.18,-5.08,-4.30,-2.86,-2.45,-3.08,-3.22,-2.76,-3.20,-3.33,-4.91,-4.06,-3.81,-3.96,-3.65,-3.77,-4.60,-5.21,-2.67,-1.95,-2.43,-1.73,-2.50,-3.96,-3.75,-2.70,-4.26,-3.42,-4.07,-4.74,-3.00,-4.37,-5.42,-5.00,-4.08,-2.46,-4.33,-4.08,-3.72,-4.09,-2.96,-3.71,-1.51,-3.70,-6.48,-4.26,-4.39,-3.16,-4.63,-2.66,-2.22,-4.79,-2.46,-3.69,-3.35,-2.32,-4.17,-3.85,-4.93,-2.05,-3.15,-3.49,-5.70,-2.53,-3.85,-4.32,-3.37,-3.98,-3.74,-5.28,-2.56,-3.21,-3.10,-3.78,-3.36,-3.32,-2.59,-2.45,-3.34,-3.20,-4.14,-4.00,-4.79,-4.02,-4.58,-4.45,-3.69,-4.53,-3.98,-4.51,-4.44,-3.78,-4.24,-4.00,-2.46,-2.58,-4.04];
 
 % Объем выборки
 n = length (X) ; 

 % Подсчет статистик
 M_max = max(X);
 M_min = min(X);

 % Размах выборки
 R = M_max - M_min; 

 % Оценка матожидания
 mu = mean(X); % ищем среднее из выборки
 s = std(X,0); % средне квадратичное отклоние 
 s_sqr = s^2; % Исправленная выборочная дисперсия

 var_series = sort(X) ; % Вариационный ряд
 stat_series = [ var_series(1) ; 1 ] ; % Стат . ряд
 % Подсчет статистического ряда
 % 1 - строка матрицы - уникальные значения
 % 2 - строка матрицы - число вхождений
 uniqs = 1 ; % Число уникальных

 for i = 2 : n
    if var_series ( i ) == var_series ( i -1)
        stat_series ( 2 , uniqs ) = stat_series ( 2 , uniqs ) + 1 ;
    else
        uniqs = uniqs + 1 ;
    stat_series ( : ,uniqs ) = [ var_series(i) ; 1 ] ;
    end
 end

 % Группировка значений выборки
 m = floor(log2(n)) + 2;

 % Построение интервального статистического ряда
 delta = R / m;
 intervals = M_min : delta : M_max ; % Интервалы

 counts = histc(var_series,intervals) ; % Число элементов в интервале
 
 disp(counts)
 % Обработка случая J_m = [ x_p , x_p+1]

 counts ( end-1) = sum( counts ( end-1:end ) ) ;
 counts ( end ) = 0;

 % Гистограмма и график функции распределения
 counts = counts / ( delta * n ) ; % Значение эмпирической функци на интервалах ;
 [ sx , sy ] = stairs ( intervals , counts ) ;

 % Функция плотности распределения N(mu, s_sqr )
 x = linspace (M_min, M_max) ;
 y = normpdf(x,mu,s) ;

 figure ( 1 ) ;
 plot ( sx , sy , x , y ) ;
 xlabel ( ' x ' ) ;
 ylabel ( ' f ' ) ;
 legend ({ 'Эмпирическая функция плотности' , 'Функция плотности нормальной слвеличины .'  } ...
     , 'Location' , 'northwest' ) ;

 % Эмпирическая функция распределения и функция распределения N(mu, s_sqr )
 % Вычисление эмпирической функции распределения
 F = [ ] ;
 for i = 1:uniqs
    F( i ) = sum( stat_series ( 2 , 1:i -1) ) ;
 end
 F = F / n ;

 % Функция распределения нормальной случайной величины
 y = normcdf ( x , mu, s ) ;

 % Построение графиков
 [ sx , sy ] = stairs ( stat_series ( 1 , : ) , F) ;

 figure ( 2 ) ;
 plot ( sx , sy , x , y ) ;
 xlabel ( 'x ') ;
 ylabel ( 'F ' ) ;
 legend ({ 'Эмпирическая функция распределения ' , 'Функция распределения нормальной сл. величины ', } ...
     , 'Location' , 'northwest' ) ;
 end